import React from 'react';
import OldDattaMandirImage from '../../src/assets/old-datta-mandir.png';
import OldDattaMandirShikharImage from '../../src/assets/old-shree-datta-mandir-kalas.jpg';

const HistoryPage = () => {
	return (
		<div className="flex flex-col-reverse md:flex-row items-center md:items-start justify-between px-6 md:px-16 py-4">
			{/* History of Datta Mandir */}
			<div className="md:w-2/3 ">
				<h1 className="text-center text-2xl font-bold my-4 text-orange-400">
					श्री दत्त मंदिराचा इतिहास
				</h1>
				<p className="text-center text-xl font-bold text-red-600 my-4">
					स्थापना : फाल्गुन शु. 10 दि. 17-02-1979{' '}
				</p>
				<p className="text-gray-700 text-justify">
					&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
					श्री सद्‌गुरु राजगिरी महाराज व श्री हालसिद्धनाथ या
					योगीराजांचे पुण्यभूमीत कुर्ली गावी श्री गुरु दत्तात्रयांचे
					मंदिर व्हावे असा संकल्प गावचे प्रतिष्ठित{' '}
					<b className="text-red-600">
						कै. विश्वनाथ बाळा माळी (जाखले रावसाहेब){' '}
					</b>
					यांनी आपले समकालीन भक्तजन सहकाऱ्यांच्या समवेत सन 1973 साली
					सोडला. कुरली गावातील प्रतिष्ठित सध्या रा. कोल्हापूर{' '}
					<b className="text-red-600">
						कै. श्रीपती तातोबा माळी व बंधू यांनी आपले वडील कै.
						तातोबा गोविंद माळी व आई कै. काशीबाई यांचे स्मरणार्थ या
						दानशूर घराण्याने कुरली येथील आपले स्वतःचे मालकीची पुरेशी
						जागा श्री दत्त मंदिर बांधण्यासाठी दान केली. गावातील
						दुसरे दानशूर घराणे कै. सिद्धू आबा मगदूम व त्यांच्या
						धर्मपत्नी सरस्वतीबाई यांनी कुर्ली येथील स्वतःचे राहते
						मालकीचे घर व येथील 26 गुंठे जमीन श्री दत्त मंदिरसाठी दान
						केली.
					</b>{' '}
					दोन्ही कुटुंबीयांनी दिलेले हे दान अमूल्य असून मंदिर इतिहासात
					चिरंतन राहणारे आहे. त्यामुळे दत्त मंदिराचे बांधकामास गती
					मिळाली.
					<br /> <br />
					&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
					मंदिर बांधकामासाठी दान स्वरूपात मिळालेल्या जागेचे सपाटीकरण
					भक्तजनांचे सेवेतून, मिळालेल्या देणगीतून झाले व त्यावर छोटेसे
					श्री दत्त मंदिर सर्वांच्या सहकार्याने उभे राहिले.{' '}
					<b className="text-red-600">
						यानंतर तिथीप्रमाणे श्री नाम सप्ताह, श्री दत्त जयंती,
						गोकुळ अष्टमी, श्री गणेश चतुर्थीला गणेश पूजन,
						गोकुळाष्टमी, बालोपासना
					</b>{' '}
					इत्यादी भक्ती उपक्रम मंदिर आवारात सुरू झाले. ते कायमपणे सुरू
					राहणार आहेत. लहान मुलांच्या श्री बालावधूत दत्तपंथी संगीत
					सोंगी भजनी मंडळाची स्थापना होऊन भजन व सोंगी भजन सेवा चालू
					झाली. कालांतराने मासिक पौर्णिमा दत्त पालखीची मंदिराभोवती
					प्रदक्षिणा व महाप्रसाद वाटप या उपक्रमाची भर पडली.
					<br />
					<br />
					&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
					मंदिराचे वाटचालीत अनेक दानशूर व्यक्ती, संघ, संघटनांनी वस्तू
					व आर्थिक स्वरूपात देणग्या दिल्या. त्यामुळे हाती घेतलेल्या
					पवित्र कामास गती लागली. त्यांचा या ठिकाणी आम्ही मुद्दाम
					उल्लेख करीत आहोत. जेष्ठ व कलानुरूप दत्तभक्तीत सामिल झालेले
					भक्तजन सेवक तसेच देणगीदार यांचेकडून आलेली देणगी यातून
					मंदिरासमोरील आरसीसी मंडप व पाठीमागील तीन आरसीसी खोल्या यांचे
					बांधकाम पूर्ण झाले. यास बराच कालावधी लागला. रक्कम उभा
					करण्यासाठी देणगी गोळा करण्याबरोबरच भिक्षा फेरी, लॉटरी व ड्रॉ
					इत्यादी उपक्रम मंदिर सेवकांकडून व भक्तजनांकडून राबविले.
					सर्वांनी मोठे परिश्रम घेतले. या ठिकाणी श्री पंतभक्त मेळावाही
					संपन्न झाला व ते मंदिराच्या सेवेत आहेत. चालू झालेल्या या
					पवित्र कामाचा व्याप दिवसेंदिवस वाढत चालला. पुढील टप्प्यात
					मंदिर मंडपावरील दुसऱ्या मजल्याचे फॅब्रिकेशन, पत्रे बसविणे व
					शिखर बांधकाम ही कामे पूर्ण झाली. त्यासाठी गाव, पंचक्रोशी
					तसेच बाहेरील भक्तांकडून देणग्या व सरकारी मदतीचा हातभार
					लागला. गावचे आराध्य दैवत श्री हालसिध्दनाथ यांचा वालंग, विविध
					धार्मिक कार्यक्रम मोठ्या प्रमाणावरील महाप्रसाद मंदिर परिसरात
					पार पडला.{' '}
					<b className="text-red-600">
						श्री दत्तगुरु व श्री हालसिध्दनाथ या दोन देवांचे भेटीचा
						हा कार्यक्रम सर्वांना आनंद देणारा झाला.
					</b>
					<br />
					<br />
					&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
					भक्तजनांचे भक्तीचा ओघ दिवसेंदिवस वाढत चालला असून यातून दत्त
					सेवा मंडळाचे भक्तजन व सेवेकरी यांनी{' '}
					<b className="text-red-600">
						कुर्ली-नृसिंहवाडी पायी दिंडी सोहळा
					</b>{' '}
					हा नवा वार्षिक भक्तिमय उपक्रम चालू केला. दिंडी सोहळ्यातील
					सामील होण्याऱ्या भक्तांची व्याप्ती दिवसेंदिवस वाढत गेली.
					श्री कृपेने मंदिराकडे चांदीच्या पादुका आहेत. त्यामुळे
					मंदिराच्या वैभवात भर पडली आहे. पायी दिंडी चालू होऊन 25 वर्षे
					पूर्ण झाली. त्यामुळे{' '}
					<b className="text-red-600">
						महोत्सवी वर्षानिमित्त विशेषांक व दिंडी मार्गात जेवण व
						चहा पण देणाऱ्यांचे आभार व ऋणनिर्देश
					</b>{' '}
					करण्यात आले. या पायी दिंडीस जाणारे भक्तजन, इतर जन यांची
					तीर्थक्षेत्री थांबण्याची सोय व्हावी यासाठी{' '}
					<b className="text-red-600">
						नृसिंहवाडी मुक्कामी दोन (02) गुंठे जागा मंडळांने खरेदी
						केली.
					</b>{' '}
					या जागेवर इकडून जाणारे सर्व भाविक विश्रांती, मुकाम करीत
					आहेत. येणारे काळात वा जागेवर निवारा करण्याचा आमचा संकल्प
					आहे.
					<br />
					<br />
					&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
					मंदिर स्थापना वाटचालीत सेवा करणारे दुसऱ्या पिढीतील
					सेवकांबरोबरच चालू काळातील
					<b className="text-red-600"> तिसरी भाविक तरुण पिढी</b>{' '}
					श्रींच्या सेवेत सामील झाली आहे. ज्येष्ठांच्या
					मार्गदर्शनानुसार मंदिरात घालू असलेल्या उपक्रमाचे ते
					श्रद्धेने व भक्तीने भाग देतात व नेमून दिलेली कामे ते पार
					पाडीत आहेत.
				</p>
			</div>

			{/* Old Datta Mandir Image */}
			<div className="flex flex-col justify-center md:justify-end mb-4 md:mb-0 gap-8 ">
				<figure>
					<img
						className="w-64 h-64 md:w-108 md:h-108 shadow-lg border-4 border-blue-800"
						src={OldDattaMandirImage}
						alt="Old Datta Mandir Image"
					/>
					<figcaption className="text-center text-red-950 font-bold mt-2">
						श्री दत्त जुने मंदिर{' '}
					</figcaption>
				</figure>

				<figure>
					<img
						className="w-64 h-64 md:w-108 md:h-108 shadow-lg border-4 border-blue-800"
						src={OldDattaMandirShikharImage}
						alt="Old Datta Mandir Shikhar Image"
					/>
					<figcaption className="text-center text-red-950 font-bold mt-2">
						श्री दत्त जुने मंदिर शिखर{' '}
					</figcaption>
				</figure>
			</div>
		</div>
	);
};

export default HistoryPage;
